TOKEN = "TOKEN"
MAWB_TOKEN = ""

ADMIN_LINK = "https://t.me/Mehechio"

ADMIN_ID = [628554295]

# Время поиска НПС для сражений от:до
ENEMY_NPC_FIND_TIME = [3, 5]

# Время ожидания хода НПС для сражений от:до
WAIT_RES_MOVE = [1, 3]

# Время на 1 ход с НПС
WAIT_MOVE_TIME = 60  # -> в последствии будет делится на 2

# Шанс на критический урон (1 из 8 к примеру)
CRITICAL_DAMAGE_CHANCE = [1, 8]

# Шанс на уворот (1 из 8 к примеру)
DODGE_CHANCE = [1, 8]

# список, содержащий количество очков опыта, необходимое для перехода на каждый уровень
POINTS_REQUIRED = [30, 60, 120, 240, 480, 960, 1920, 3840, 5760, 8640, 12960, 16840, 21900, 28470, 37030, 48150, 62590,
                   81370, 105780, 137520, 206280, 309420, 464130, 696190, 1044290, 1670860, 2840470, 5112850, 9714420,
                   19428840, 38857680, 77777777]

# Тут можно изменить количество получаемого опыта, трогать 4, 7, 10 не стоит
USER_GETTING_LVL = {4: [18, 25], 7: [40, 65], 10: [80, 110]}
USER_GETTING_GOLD = {4: [1, 3], 7: [4, 8], 10: [4, 10]}

# не трогать
LIMITS = [4, 7, 10]

# в торговле какие значения будут по передаче золота
GOLD_LIMITS = [1, 5, 10, 20, 50, 100, 200, 500]

# в торговле какие значения будут по передаче купонов
COUPON_LIMITS = [1, 5, 10, 20]

CLAN_COST = 500

CLAN_USERS_COUNT = 50

CHANGE_CLAN_TITLE_COST = 400


COUPONS_COST = {
    5: 100,
    25: 399,
    50: 699,
    100: 1199,
    200: 2199
}



PVP_POINTS_REWARD_ONLINE = 3
GLORY_REWARD_ONLINE = 3

GLORY_DISCARD_ONLINE = 2
PVP_POINTS_DISCARD_ONLINE = 2

MOVE_TIME_ONLINE = 20

CLAN_WAR_DAYS_TIME = 15

